<a href="https://colab.research.google.com/github/DanielMdevlop/PythonDataScience/blob/main/01Intro_seaborn.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## **Seaborn**

seaborn es una librería de visualización de datos para Python desarrollada sobre matplotlib. Ofrece una interfaz de alto nivel para la creación de atractivas gráficas. Además, está íntimamente integrada con las estructuras de datos de pandas, lo que permite utilizar el nombre de los DataFrames y campos directamente como argumentos de las funciones de visualización.

Esta libreria se importa habitualmente con el alias sns:

**`import seaborn as sns`**

In [ ]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import seaborn as sns
import warnings

%matplotlib inline

In [ ]:
np.random.seed(18)  #inicialización del generador de numero aleatorios
warnings.filterwarnings("ignore") #ocultar avisos
sns.set()  #estilo grafico de seaborn

## **Funcionalidad de seaborn**

* Funciones con una API estandarizada que limita la necesidad de tener que memorizar conjuntos de parámetros diferentes en función del gráfico deseado:
* Gráficas visualmente atractivas sin necesidad de realizar complicados ajustes
* Una API orientada a conjuntos de datos para examinar la relación entre múltiples variables.
* Opciones para mostrar la distribución de variables univariadas y bivariadas.
* Cálculo automático y dibujo de modelos de regresión lineal para diferentes tipos de variables dependientes
* Herramientas para mostrar la estructura de datasets complejos.
* Abstracciones de alto nivel para estructurar rejillas multigráficas con el objetivo de poder crear complejas visualizaciones.
* Sencillo control sobre los estilos gráficos disponibles.
* Herramientas para la elección de paletas de color adecuadas que permitan revelar patrones en los datos

seaborn ofrece dos tipos de funciones graficas:
* nivel de figura
* nivel de ejes

Nivel de figura: No se puede controlar la figura y el conjunto de ejes.
Nivel de ejes: Si permite el control de la figura y el conjunto de ejes.

Si las funciones admiten el parametro ax -> nivel de ejes
Si las funciones devuelven un objeto de tipo AXES -> nivel de ejes.
Si se trata de un objeto FacetGrid -> Funcion de nivel figura.

## **DataSets**

seaborn incluye datasets, de ejemplo para practicar las visualizaciónes:

In [ ]:
#Dataset con información sobre pasajeros transportados en avión por mes entre 1949 y 1960
flights = sns.load_dataset("flights")
flights.sample(5)

     year month  passengers
110  1958   Mar         362
96   1957   Jan         315
24   1951   Jan         145
74   1955   Mar         267
82   1955   Nov         237

In [ ]:
#Conjunto de datos con información sobre los pasajeros del último viaje del Titanic, 
#con información sobre quiénes sobrevivieron, su edad, sexo, clase en la que viajaban.
titanic = sns.load_dataset("titanic")
titanic.sample(5)

     survived  pclass     sex    age  ...  deck  embark_town  alive  alone
803         1       3    male   0.42  ...   NaN    Cherbourg    yes  False
266         0       3    male  16.00  ...   NaN  Southampton     no  False
246         0       3  female  25.00  ...   NaN  Southampton     no   True
556         1       1  female  48.00  ...     A    Cherbourg    yes  False
473         1       2  female  23.00  ...     D    Cherbourg    yes   True

[5 rows x 15 columns]

In [ ]:
#con información de la longitud y ancho de pétalos y sépalos de 150 flores Iris de tres especies relacionadas.
iris = sns.load_dataset("iris")
iris.sample(5)

     sepal_length  sepal_width  petal_length  petal_width     species
148           6.2          3.4           5.4          2.3   virginica
106           4.9          2.5           4.5          1.7   virginica
93            5.0          2.3           3.3          1.0  versicolor
88            5.6          3.0           4.1          1.3  versicolor
55            5.7          2.8           4.5          1.3  versicolor

In [ ]:
#este conjunto de datos hay información sobre propinas dejadas en un restaurante, 
#con información sobre el día en el que se produjo, si fue en el almuerzo o la cena,
#el número de comensales, el sexo de la persona que dejó la propina, si era fumador o no.
tips = sns.load_dataset("tips")
tips.sample(5)

     total_bill   tip     sex smoker   day    time  size
232       11.61  3.39    Male     No   Sat  Dinner     2
100       11.35  2.50  Female    Yes   Fri  Dinner     2
117       10.65  1.50  Female     No  Thur   Lunch     2
157       25.00  3.75  Female     No   Sun  Dinner     4
80        19.44  3.00    Male    Yes  Thur   Lunch     2